<template>
    <section>
        <h1>{{rnd}}</h1>
    </section>
</template>

<script>
export default {
    data(){
        return{
            problems:{
                q1:'476年、西ローマ帝国を滅ぼしたゲルマン人の傭兵隊長は誰か？',
                q2:'481年、フランク人を統一してフランク王国にメロヴィング朝を開いた人物は誰か？',
                q3:'732年、トゥール・ポワティエ間の戦いでイスラム勢力の侵攻を食い止めたメロヴィング朝の宮宰は誰か？',
                q4:'726年、ビザンツ皇帝が聖像禁止令を発布した。それに関連する説明として誤りがひとつある。それはどれか？',
                q5:'800年、ローマ教皇レオ3世がフランク国王に対してローマ皇帝の名を与え、西ローマ帝国の復活を宣言したことを何と呼ぶ？',
                q6:'カール大帝の死後、フランク王国は3つに分裂する。現在のドイツ・フランス・イタリアにつながる3国に分割した870年に結ばれた条約を何と呼ぶ？',
                q7:'962年、東フランク（ドイツ）のオットー1世を初代皇帝として始まった国を何と呼ぶ？',
                q8:'9世紀〜12世紀、ノルマン人がヨーロッパ各地に遠征していくつかの国を建てた。以下のうちノルマン人が建てた国ではないものがひとつある。それはどれか？',
                q9:'882年、ノルマン人の一派がドニエプル川流域に建国してロシアの起源となった国は？',
                q10:'西ヨーロッパ中世世界における封建社会の説明について誤っているものがひとつある。それはどれか？'
            }
        }
    },
    computed:{
        round(){
            return this.$store.state.round
        },
        rnd(){
            return eval(`this.problems.q${this.round}`)
        }
    },
    methods:{
    }
}
</script>